tyh21/da14585_420/da14585_420_Paged_Clock/sdk/platform/driver/ble/reg_ripple.h
// field definitions
#define RPL_TX_DN_DLY5_MASK   ((uint32_t)0xFFC00000)
#define RPL_TX_DN_DLY5_LSB    22
#define RPL_TX_DN_DLY5_WIDTH  ((uint32_t)0x0000000A)
#define RPL_TX_DN_DLY4_MASK   ((uint32_t)0x001FF800)
#define RPL_TX_DN_DLY4_LSB    11
#define RPL_TX_DN_DLY4_WIDTH  ((uint32_t)0x0000000A)
#define RPL_TX_DN_DLY3_MASK   ((uint32_t)0x000003FF)
#define RPL_TX_DN_DLY3_LSB    0
#define RPL_TX_DN_DLY3_WIDTH  ((uint32_t)0x0000000A)

#define RPL_TX_DN_DLY5_RST    0x1
#define RPL_TX_DN_DLY4_RST    0x1
#define RPL_TX_DN_DLY3_RST    0x1

__STATIC_FORCEINLINE void rpl_rftxdn_dly1_pack(uint16_t txdndly5, uint16_t txdndly4, uint16_t txdndly3)
{
    ASSERT_ERR((((uint32_t)txdndly5 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    ASSERT_ERR((((uint32_t)txdndly4 << 11) & ~((uint32_t)0x001FF800)) == 0);
    ASSERT_ERR((((uint32_t)txdndly3 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFTXDN_DLY1_ADDR,  ((uint32_t)txdndly5 << 22) | ((uint32_t)txdndly4 << 11) | ((uint32_t)txdndly3 << 0));
}

__STATIC_FORCEINLINE void rpl_rftxdn_dly1_unpack(uint16_t* txdndly5, uint16_t* txdndly4, uint16_t* txdndly3)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXDN_DLY1_ADDR);

    *txdndly5 = (localVal & ((uint32_t)0xFFC00000)) >> 22;
    *txdndly4 = (localVal & ((uint32_t)0x001FF800)) >> 11;
    *txdndly3 = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__STATIC_FORCEINLINE uint16_t rpl_tx_dn_dly5_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXDN_DLY1_ADDR);
    return ((localVal & ((uint32_t)0xFFC00000)) >> 22);
}

__STATIC_FORCEINLINE void rpl_tx_dn_dly5_setf(uint16_t txdndly5)
{
    ASSERT_ERR((((uint32_t)txdndly5 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    REG_RPL_WR(RPL_RFTXDN_DLY1_ADDR, (REG_RPL_RD(RPL_RFTXDN_DLY1_ADDR) & ~((uint32_t)0xFFC00000)) | ((uint32_t)txdndly5 << 22));
}

__STATIC_FORCEINLINE uint16_t rpl_tx_dn_dly4_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXDN_DLY1_ADDR);
    return ((localVal & ((uint32_t)0x001FF800)) >> 11);
}

__STATIC_FORCEINLINE void rpl_tx_dn_dly4_setf(uint16_t txdndly4)
{
    ASSERT_ERR((((uint32_t)txdndly4 << 11) & ~((uint32_t)0x001FF800)) == 0);
    REG_RPL_WR(RPL_RFTXDN_DLY1_ADDR, (REG_RPL_RD(RPL_RFTXDN_DLY1_ADDR) & ~((uint32_t)0x001FF800)) | ((uint32_t)txdndly4 << 11));
}

__STATIC_FORCEINLINE uint16_t rpl_tx_dn_dly3_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXDN_DLY1_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

__STATIC_FORCEINLINE void rpl_tx_dn_dly3_setf(uint16_t txdndly3)
{
    ASSERT_ERR((((uint32_t)txdndly3 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFTXDN_DLY1_ADDR, (REG_RPL_RD(RPL_RFTXDN_DLY1_ADDR) & ~((uint32_t)0x000003FF)) | ((uint32_t)txdndly3 << 0));
}

/**
 * @brief RFTXDN_DLY2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:22           TX_DN_DLY8   0x1
 *  20:11           TX_DN_DLY7   0x1
 *  09:00           TX_DN_DLY6   0x1
 * </pre>
 */
#define RPL_RFTXDN_DLY2_ADDR   0x00000008
#define RPL_RFTXDN_DLY2_OFFSET 0x00000008
#define RPL_RFTXDN_DLY2_INDEX  0x00000008
#define RPL_RFTXDN_DLY2_RESET  0x00400801

__STATIC_FORCEINLINE uint32_t rpl_rftxdn_dly2_get(void)
{
    return REG_RPL_RD(RPL_RFTXDN_DLY2_ADDR);
}

__STATIC_FORCEINLINE void rpl_rftxdn_dly2_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFTXDN_DLY2_ADDR, value);
}

// field definitions
#define RPL_TX_DN_DLY8_MASK   ((uint32_t)0xFFC00000)
#define RPL_TX_DN_DLY8_LSB    22
#define RPL_TX_DN_DLY8_WIDTH  ((uint32_t)0x0000000A)
#define RPL_TX_DN_DLY7_MASK   ((uint32_t)0x001FF800)
#define RPL_TX_DN_DLY7_LSB    11
#define RPL_TX_DN_DLY7_WIDTH  ((uint32_t)0x0000000A)
#define RPL_TX_DN_DLY6_MASK   ((uint32_t)0x000003FF)
#define RPL_TX_DN_DLY6_LSB    0
#define RPL_TX_DN_DLY6_WIDTH  ((uint32_t)0x0000000A)

#define RPL_TX_DN_DLY8_RST    0x1
#define RPL_TX_DN_DLY7_RST    0x1
#define RPL_TX_DN_DLY6_RST    0x1

__STATIC_FORCEINLINE void rpl_rftxdn_dly2_pack(uint16_t txdndly8, uint16_t txdndly7, uint16_t txdndly6)
{
    ASSERT_ERR((((uint32_t)txdndly8 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    ASSERT_ERR((((uint32_t)txdndly7 << 11) & ~((uint32_t)0x001FF800)) == 0);
    ASSERT_ERR((((uint32_t)txdndly6 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFTXDN_DLY2_ADDR,  ((uint32_t)txdndly8 << 22) | ((uint32_t)txdndly7 << 11) | ((uint32_t)txdndly6 << 0));
}

__STATIC_FORCEINLINE void rpl_rftxdn_dly2_unpack(uint16_t* txdndly8, uint16_t* txdndly7, uint16_t* txdndly6)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXDN_DLY2_ADDR);

    *txdndly8 = (localVal & ((uint32_t)0xFFC00000)) >> 22;
    *txdndly7 = (localVal & ((uint32_t)0x001FF800)) >> 11;
    *txdndly6 = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__STATIC_FORCEINLINE uint16_t rpl_tx_dn_dly8_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXDN_DLY2_ADDR);
    return ((localVal & ((uint32_t)0xFFC00000)) >> 22);
}

__STATIC_FORCEINLINE void rpl_tx_dn_dly8_setf(uint16_t txdndly8)
{
    ASSERT_ERR((((uint32_t)txdndly8 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    REG_RPL_WR(RPL_RFTXDN_DLY2_ADDR, (REG_RPL_RD(RPL_RFTXDN_DLY2_ADDR) & ~((uint32_t)0xFFC00000)) | ((uint32_t)txdndly8 << 22));
}

__STATIC_FORCEINLINE uint16_t rpl_tx_dn_dly7_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXDN_DLY2_ADDR);
    return ((localVal & ((uint32_t)0x001FF800)) >> 11);
}

__STATIC_FORCEINLINE void rpl_tx_dn_dly7_setf(uint16_t txdndly7)
{
    ASSERT_ERR((((uint32_t)txdndly7 << 11) & ~((uint32_t)0x001FF800)) == 0);
    REG_RPL_WR(RPL_RFTXDN_DLY2_ADDR, (REG_RPL_RD(RPL_RFTXDN_DLY2_ADDR) & ~((uint32_t)0x001FF800)) | ((uint32_t)txdndly7 << 11));
}

__STATIC_FORCEINLINE uint16_t rpl_tx_dn_dly6_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXDN_DLY2_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

__STATIC_FORCEINLINE void rpl_tx_dn_dly6_setf(uint16_t txdndly6)
{
    ASSERT_ERR((((uint32_t)txdndly6 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFTXDN_DLY2_ADDR, (REG_RPL_RD(RPL_RFTXDN_DLY2_ADDR) & ~((uint32_t)0x000003FF)) | ((uint32_t)txdndly6 << 0));
}

/**
 * @brief RFRXUP_DLY0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:22           RX_UP_DLY2   0x19
 *  20:11           RX_UP_DLY1   0x206
 *  09:00           RX_UP_DLY0   0x1
 * </pre>
 */
#define RPL_RFRXUP_DLY0_ADDR   0x00000009
#define RPL_RFRXUP_DLY0_OFFSET 0x00000009
#define RPL_RFRXUP_DLY0_INDEX  0x00000009
#define RPL_RFRXUP_DLY0_RESET  0x06503001

__STATIC_FORCEINLINE uint32_t rpl_rfrxup_dly0_get(void)
{
    return REG_RPL_RD(RPL_RFRXUP_DLY0_ADDR);
}

__STATIC_FORCEINLINE void rpl_rfrxup_dly0_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFRXUP_DLY0_ADDR, value);
}

