tyh21/da14585_420/da14585_420_Paged_Clock/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE uint32_t rpl_rfrxup_dly2_get(void)
{
    return REG_RPL_RD(RPL_RFRXUP_DLY2_ADDR);
}

__STATIC_FORCEINLINE void rpl_rfrxup_dly2_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFRXUP_DLY2_ADDR, value);
}

// field definitions
#define RPL_RX_UP_DLY8_MASK   ((uint32_t)0xFFC00000)
#define RPL_RX_UP_DLY8_LSB    22
#define RPL_RX_UP_DLY8_WIDTH  ((uint32_t)0x0000000A)
#define RPL_RX_UP_DLY7_MASK   ((uint32_t)0x001FF800)
#define RPL_RX_UP_DLY7_LSB    11
#define RPL_RX_UP_DLY7_WIDTH  ((uint32_t)0x0000000A)
#define RPL_RX_UP_DLY6_MASK   ((uint32_t)0x000003FF)
#define RPL_RX_UP_DLY6_LSB    0
#define RPL_RX_UP_DLY6_WIDTH  ((uint32_t)0x0000000A)

#define RPL_RX_UP_DLY8_RST    0x1
#define RPL_RX_UP_DLY7_RST    0x1
#define RPL_RX_UP_DLY6_RST    0x1

__STATIC_FORCEINLINE void rpl_rfrxup_dly2_pack(uint16_t rxupdly8, uint16_t rxupdly7, uint16_t rxupdly6)
{
    ASSERT_ERR((((uint32_t)rxupdly8 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    ASSERT_ERR((((uint32_t)rxupdly7 << 11) & ~((uint32_t)0x001FF800)) == 0);
    ASSERT_ERR((((uint32_t)rxupdly6 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFRXUP_DLY2_ADDR,  ((uint32_t)rxupdly8 << 22) | ((uint32_t)rxupdly7 << 11) | ((uint32_t)rxupdly6 << 0));
}

__STATIC_FORCEINLINE void rpl_rfrxup_dly2_unpack(uint16_t* rxupdly8, uint16_t* rxupdly7, uint16_t* rxupdly6)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXUP_DLY2_ADDR);

    *rxupdly8 = (localVal & ((uint32_t)0xFFC00000)) >> 22;
    *rxupdly7 = (localVal & ((uint32_t)0x001FF800)) >> 11;
    *rxupdly6 = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__STATIC_FORCEINLINE uint16_t rpl_rx_up_dly8_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXUP_DLY2_ADDR);
    return ((localVal & ((uint32_t)0xFFC00000)) >> 22);
}

__STATIC_FORCEINLINE void rpl_rx_up_dly8_setf(uint16_t rxupdly8)
{
    ASSERT_ERR((((uint32_t)rxupdly8 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    REG_RPL_WR(RPL_RFRXUP_DLY2_ADDR, (REG_RPL_RD(RPL_RFRXUP_DLY2_ADDR) & ~((uint32_t)0xFFC00000)) | ((uint32_t)rxupdly8 << 22));
}

__STATIC_FORCEINLINE uint16_t rpl_rx_up_dly7_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXUP_DLY2_ADDR);
    return ((localVal & ((uint32_t)0x001FF800)) >> 11);
}

__STATIC_FORCEINLINE void rpl_rx_up_dly7_setf(uint16_t rxupdly7)
{
    ASSERT_ERR((((uint32_t)rxupdly7 << 11) & ~((uint32_t)0x001FF800)) == 0);
    REG_RPL_WR(RPL_RFRXUP_DLY2_ADDR, (REG_RPL_RD(RPL_RFRXUP_DLY2_ADDR) & ~((uint32_t)0x001FF800)) | ((uint32_t)rxupdly7 << 11));
}

__STATIC_FORCEINLINE uint16_t rpl_rx_up_dly6_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXUP_DLY2_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

__STATIC_FORCEINLINE void rpl_rx_up_dly6_setf(uint16_t rxupdly6)
{
    ASSERT_ERR((((uint32_t)rxupdly6 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFRXUP_DLY2_ADDR, (REG_RPL_RD(RPL_RFRXUP_DLY2_ADDR) & ~((uint32_t)0x000003FF)) | ((uint32_t)rxupdly6 << 0));
}

/**
 * @brief RFRXDN_DLY0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:22           RX_DN_DLY2   0x1
 *  20:11           RX_DN_DLY1   0x19
 *  09:00           RX_DN_DLY0   0x19
 * </pre>
 */
#define RPL_RFRXDN_DLY0_ADDR   0x0000000C
#define RPL_RFRXDN_DLY0_OFFSET 0x0000000C
#define RPL_RFRXDN_DLY0_INDEX  0x0000000C
#define RPL_RFRXDN_DLY0_RESET  0x0040C819

__STATIC_FORCEINLINE uint32_t rpl_rfrxdn_dly0_get(void)
{
    return REG_RPL_RD(RPL_RFRXDN_DLY0_ADDR);
}

__STATIC_FORCEINLINE void rpl_rfrxdn_dly0_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFRXDN_DLY0_ADDR, value);
}

// field definitions
#define RPL_RX_DN_DLY2_MASK   ((uint32_t)0xFFC00000)
#define RPL_RX_DN_DLY2_LSB    22
#define RPL_RX_DN_DLY2_WIDTH  ((uint32_t)0x0000000A)
#define RPL_RX_DN_DLY1_MASK   ((uint32_t)0x001FF800)
#define RPL_RX_DN_DLY1_LSB    11
#define RPL_RX_DN_DLY1_WIDTH  ((uint32_t)0x0000000A)
#define RPL_RX_DN_DLY0_MASK   ((uint32_t)0x000003FF)
#define RPL_RX_DN_DLY0_LSB    0
#define RPL_RX_DN_DLY0_WIDTH  ((uint32_t)0x0000000A)

#define RPL_RX_DN_DLY2_RST    0x1
#define RPL_RX_DN_DLY1_RST    0x19
#define RPL_RX_DN_DLY0_RST    0x19

__STATIC_FORCEINLINE void rpl_rfrxdn_dly0_pack(uint16_t rxdndly2, uint16_t rxdndly1, uint16_t rxdndly0)
{
    ASSERT_ERR((((uint32_t)rxdndly2 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    ASSERT_ERR((((uint32_t)rxdndly1 << 11) & ~((uint32_t)0x001FF800)) == 0);
    ASSERT_ERR((((uint32_t)rxdndly0 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFRXDN_DLY0_ADDR,  ((uint32_t)rxdndly2 << 22) | ((uint32_t)rxdndly1 << 11) | ((uint32_t)rxdndly0 << 0));
}

__STATIC_FORCEINLINE void rpl_rfrxdn_dly0_unpack(uint16_t* rxdndly2, uint16_t* rxdndly1, uint16_t* rxdndly0)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXDN_DLY0_ADDR);

    *rxdndly2 = (localVal & ((uint32_t)0xFFC00000)) >> 22;
    *rxdndly1 = (localVal & ((uint32_t)0x001FF800)) >> 11;
    *rxdndly0 = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__STATIC_FORCEINLINE uint16_t rpl_rx_dn_dly2_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXDN_DLY0_ADDR);
    return ((localVal & ((uint32_t)0xFFC00000)) >> 22);
}

__STATIC_FORCEINLINE void rpl_rx_dn_dly2_setf(uint16_t rxdndly2)
{
    ASSERT_ERR((((uint32_t)rxdndly2 << 22) & ~((uint32_t)0xFFC00000)) == 0);
    REG_RPL_WR(RPL_RFRXDN_DLY0_ADDR, (REG_RPL_RD(RPL_RFRXDN_DLY0_ADDR) & ~((uint32_t)0xFFC00000)) | ((uint32_t)rxdndly2 << 22));
}

__STATIC_FORCEINLINE uint16_t rpl_rx_dn_dly1_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXDN_DLY0_ADDR);
    return ((localVal & ((uint32_t)0x001FF800)) >> 11);
}

__STATIC_FORCEINLINE void rpl_rx_dn_dly1_setf(uint16_t rxdndly1)
{
    ASSERT_ERR((((uint32_t)rxdndly1 << 11) & ~((uint32_t)0x001FF800)) == 0);
    REG_RPL_WR(RPL_RFRXDN_DLY0_ADDR, (REG_RPL_RD(RPL_RFRXDN_DLY0_ADDR) & ~((uint32_t)0x001FF800)) | ((uint32_t)rxdndly1 << 11));
}

__STATIC_FORCEINLINE uint16_t rpl_rx_dn_dly0_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXDN_DLY0_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

__STATIC_FORCEINLINE void rpl_rx_dn_dly0_setf(uint16_t rxdndly0)
{
    ASSERT_ERR((((uint32_t)rxdndly0 << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_RFRXDN_DLY0_ADDR, (REG_RPL_RD(RPL_RFRXDN_DLY0_ADDR) & ~((uint32_t)0x000003FF)) | ((uint32_t)rxdndly0 << 0));
}

/**
 * @brief RFRXDN_DLY1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:22           RX_DN_DLY5   0x1
 *  20:11           RX_DN_DLY4   0x1
 *  09:00           RX_DN_DLY3   0x1
 * </pre>
 */
#define RPL_RFRXDN_DLY1_ADDR   0x0000000D
#define RPL_RFRXDN_DLY1_OFFSET 0x0000000D
#define RPL_RFRXDN_DLY1_INDEX  0x0000000D
#define RPL_RFRXDN_DLY1_RESET  0x00400801

__STATIC_FORCEINLINE uint32_t rpl_rfrxdn_dly1_get(void)
{
    return REG_RPL_RD(RPL_RFRXDN_DLY1_ADDR);
}

