tyh21/da14585_420/da14585_420_Paged_Clock/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE uint32_t rpl_seqtxup_out0_get(void)
{
    return REG_RPL_RD(RPL_SEQTXUP_OUT0_ADDR);
}

__STATIC_FORCEINLINE void rpl_seqtxup_out0_set(uint32_t value)
{
    REG_RPL_WR(RPL_SEQTXUP_OUT0_ADDR, value);
}

// field definitions
#define RPL_TX_UP_OUT2_MASK   ((uint32_t)0x7FC00000)
#define RPL_TX_UP_OUT2_LSB    22
#define RPL_TX_UP_OUT2_WIDTH  ((uint32_t)0x00000009)
#define RPL_TX_UP_OUT1_MASK   ((uint32_t)0x000FF800)
#define RPL_TX_UP_OUT1_LSB    11
#define RPL_TX_UP_OUT1_WIDTH  ((uint32_t)0x00000009)
#define RPL_TX_UP_OUT0_MASK   ((uint32_t)0x000001FF)
#define RPL_TX_UP_OUT0_LSB    0
#define RPL_TX_UP_OUT0_WIDTH  ((uint32_t)0x00000009)

#define RPL_TX_UP_OUT2_RST    0x7
#define RPL_TX_UP_OUT1_RST    0x3
#define RPL_TX_UP_OUT0_RST    0x1

__STATIC_FORCEINLINE void rpl_seqtxup_out0_pack(uint16_t txupout2, uint16_t txupout1, uint16_t txupout0)
{
    ASSERT_ERR((((uint32_t)txupout2 << 22) & ~((uint32_t)0x7FC00000)) == 0);
    ASSERT_ERR((((uint32_t)txupout1 << 11) & ~((uint32_t)0x000FF800)) == 0);
    ASSERT_ERR((((uint32_t)txupout0 << 0) & ~((uint32_t)0x000001FF)) == 0);
    REG_RPL_WR(RPL_SEQTXUP_OUT0_ADDR,  ((uint32_t)txupout2 << 22) | ((uint32_t)txupout1 << 11) | ((uint32_t)txupout0 << 0));
}

__STATIC_FORCEINLINE void rpl_seqtxup_out0_unpack(uint16_t* txupout2, uint16_t* txupout1, uint16_t* txupout0)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQTXUP_OUT0_ADDR);

    *txupout2 = (localVal & ((uint32_t)0x7FC00000)) >> 22;
    *txupout1 = (localVal & ((uint32_t)0x000FF800)) >> 11;
    *txupout0 = (localVal & ((uint32_t)0x000001FF)) >> 0;
}

__STATIC_FORCEINLINE uint16_t rpl_tx_up_out2_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQTXUP_OUT0_ADDR);
    return ((localVal & ((uint32_t)0x7FC00000)) >> 22);
}

__STATIC_FORCEINLINE void rpl_tx_up_out2_setf(uint16_t txupout2)
{
    ASSERT_ERR((((uint32_t)txupout2 << 22) & ~((uint32_t)0x7FC00000)) == 0);
    REG_RPL_WR(RPL_SEQTXUP_OUT0_ADDR, (REG_RPL_RD(RPL_SEQTXUP_OUT0_ADDR) & ~((uint32_t)0x7FC00000)) | ((uint32_t)txupout2 << 22));
}

__STATIC_FORCEINLINE uint16_t rpl_tx_up_out1_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQTXUP_OUT0_ADDR);
    return ((localVal & ((uint32_t)0x000FF800)) >> 11);
}

__STATIC_FORCEINLINE void rpl_tx_up_out1_setf(uint16_t txupout1)
{
    ASSERT_ERR((((uint32_t)txupout1 << 11) & ~((uint32_t)0x000FF800)) == 0);
    REG_RPL_WR(RPL_SEQTXUP_OUT0_ADDR, (REG_RPL_RD(RPL_SEQTXUP_OUT0_ADDR) & ~((uint32_t)0x000FF800)) | ((uint32_t)txupout1 << 11));
}

__STATIC_FORCEINLINE uint16_t rpl_tx_up_out0_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQTXUP_OUT0_ADDR);
    return ((localVal & ((uint32_t)0x000001FF)) >> 0);
}

__STATIC_FORCEINLINE void rpl_tx_up_out0_setf(uint16_t txupout0)
{
    ASSERT_ERR((((uint32_t)txupout0 << 0) & ~((uint32_t)0x000001FF)) == 0);
    REG_RPL_WR(RPL_SEQTXUP_OUT0_ADDR, (REG_RPL_RD(RPL_SEQTXUP_OUT0_ADDR) & ~((uint32_t)0x000001FF)) | ((uint32_t)txupout0 << 0));
}

/**
 * @brief SEQTXUP_OUT1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  30:22           TX_UP_OUT5   0x1F
 *  19:11           TX_UP_OUT4   0x1F
 *  08:00           TX_UP_OUT3   0xF
 * </pre>
 */
#define RPL_SEQTXUP_OUT1_ADDR   0x00000010
#define RPL_SEQTXUP_OUT1_OFFSET 0x00000010
#define RPL_SEQTXUP_OUT1_INDEX  0x00000010
#define RPL_SEQTXUP_OUT1_RESET  0x07C0F80F

__STATIC_FORCEINLINE uint32_t rpl_seqtxup_out1_get(void)
{
    return REG_RPL_RD(RPL_SEQTXUP_OUT1_ADDR);
}

__STATIC_FORCEINLINE void rpl_seqtxup_out1_set(uint32_t value)
{
    REG_RPL_WR(RPL_SEQTXUP_OUT1_ADDR, value);
}

// field definitions
#define RPL_TX_UP_OUT5_MASK   ((uint32_t)0x7FC00000)
#define RPL_TX_UP_OUT5_LSB    22
#define RPL_TX_UP_OUT5_WIDTH  ((uint32_t)0x00000009)
#define RPL_TX_UP_OUT4_MASK   ((uint32_t)0x000FF800)
#define RPL_TX_UP_OUT4_LSB    11
#define RPL_TX_UP_OUT4_WIDTH  ((uint32_t)0x00000009)
#define RPL_TX_UP_OUT3_MASK   ((uint32_t)0x000001FF)
#define RPL_TX_UP_OUT3_LSB    0
#define RPL_TX_UP_OUT3_WIDTH  ((uint32_t)0x00000009)

#define RPL_TX_UP_OUT5_RST    0x1F
#define RPL_TX_UP_OUT4_RST    0x1F
#define RPL_TX_UP_OUT3_RST    0xF

__STATIC_FORCEINLINE void rpl_seqtxup_out1_pack(uint16_t txupout5, uint16_t txupout4, uint16_t txupout3)
{
    ASSERT_ERR((((uint32_t)txupout5 << 22) & ~((uint32_t)0x7FC00000)) == 0);
    ASSERT_ERR((((uint32_t)txupout4 << 11) & ~((uint32_t)0x000FF800)) == 0);
    ASSERT_ERR((((uint32_t)txupout3 << 0) & ~((uint32_t)0x000001FF)) == 0);
    REG_RPL_WR(RPL_SEQTXUP_OUT1_ADDR,  ((uint32_t)txupout5 << 22) | ((uint32_t)txupout4 << 11) | ((uint32_t)txupout3 << 0));
}

__STATIC_FORCEINLINE void rpl_seqtxup_out1_unpack(uint16_t* txupout5, uint16_t* txupout4, uint16_t* txupout3)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQTXUP_OUT1_ADDR);

    *txupout5 = (localVal & ((uint32_t)0x7FC00000)) >> 22;
    *txupout4 = (localVal & ((uint32_t)0x000FF800)) >> 11;
    *txupout3 = (localVal & ((uint32_t)0x000001FF)) >> 0;
}

__STATIC_FORCEINLINE uint16_t rpl_tx_up_out5_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQTXUP_OUT1_ADDR);
    return ((localVal & ((uint32_t)0x7FC00000)) >> 22);
}

__STATIC_FORCEINLINE void rpl_tx_up_out5_setf(uint16_t txupout5)
{
    ASSERT_ERR((((uint32_t)txupout5 << 22) & ~((uint32_t)0x7FC00000)) == 0);
    REG_RPL_WR(RPL_SEQTXUP_OUT1_ADDR, (REG_RPL_RD(RPL_SEQTXUP_OUT1_ADDR) & ~((uint32_t)0x7FC00000)) | ((uint32_t)txupout5 << 22));
}

__STATIC_FORCEINLINE uint16_t rpl_tx_up_out4_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQTXUP_OUT1_ADDR);
    return ((localVal & ((uint32_t)0x000FF800)) >> 11);
}

__STATIC_FORCEINLINE void rpl_tx_up_out4_setf(uint16_t txupout4)
{
    ASSERT_ERR((((uint32_t)txupout4 << 11) & ~((uint32_t)0x000FF800)) == 0);
    REG_RPL_WR(RPL_SEQTXUP_OUT1_ADDR, (REG_RPL_RD(RPL_SEQTXUP_OUT1_ADDR) & ~((uint32_t)0x000FF800)) | ((uint32_t)txupout4 << 11));
}

__STATIC_FORCEINLINE uint16_t rpl_tx_up_out3_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQTXUP_OUT1_ADDR);
    return ((localVal & ((uint32_t)0x000001FF)) >> 0);
}

__STATIC_FORCEINLINE void rpl_tx_up_out3_setf(uint16_t txupout3)
{
    ASSERT_ERR((((uint32_t)txupout3 << 0) & ~((uint32_t)0x000001FF)) == 0);
    REG_RPL_WR(RPL_SEQTXUP_OUT1_ADDR, (REG_RPL_RD(RPL_SEQTXUP_OUT1_ADDR) & ~((uint32_t)0x000001FF)) | ((uint32_t)txupout3 << 0));
}

/**
 * @brief SEQTXUP_OUT2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  30:22           TX_UP_OUT8   0x1F
 *  19:11           TX_UP_OUT7   0x1F
 *  08:00           TX_UP_OUT6   0x1F
 * </pre>
 */
#define RPL_SEQTXUP_OUT2_ADDR   0x00000011
#define RPL_SEQTXUP_OUT2_OFFSET 0x00000011
#define RPL_SEQTXUP_OUT2_INDEX  0x00000011
#define RPL_SEQTXUP_OUT2_RESET  0x07C0F81F

__STATIC_FORCEINLINE uint32_t rpl_seqtxup_out2_get(void)
{
    return REG_RPL_RD(RPL_SEQTXUP_OUT2_ADDR);
}

__STATIC_FORCEINLINE void rpl_seqtxup_out2_set(uint32_t value)
{
    REG_RPL_WR(RPL_SEQTXUP_OUT2_ADDR, value);
}

