tyh21/da14585_420/da14585_420_Paged_Clock/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE void rpl_rpll_icp_offset_setf(uint8_t rpllicpoffset)
{
    ASSERT_ERR((((uint32_t)rpllicpoffset << 12) & ~((uint32_t)0x00007000)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL1_ADDR, (REG_RPL_RD(RPL_RPLLCNTL1_ADDR) & ~((uint32_t)0x00007000)) | ((uint32_t)rpllicpoffset << 12));
}

__STATIC_FORCEINLINE uint8_t rpl_rpll_icp_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00000F00)) >> 8);
}

__STATIC_FORCEINLINE void rpl_rpll_icp_setf(uint8_t rpllicp)
{
    ASSERT_ERR((((uint32_t)rpllicp << 8) & ~((uint32_t)0x00000F00)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL1_ADDR, (REG_RPL_RD(RPL_RPLLCNTL1_ADDR) & ~((uint32_t)0x00000F00)) | ((uint32_t)rpllicp << 8));
}

__STATIC_FORCEINLINE uint8_t rpl_rpll_vcofc_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x000000F0)) >> 4);
}

__STATIC_FORCEINLINE void rpl_rpll_vcofc_setf(uint8_t rpllvcofc)
{
    ASSERT_ERR((((uint32_t)rpllvcofc << 4) & ~((uint32_t)0x000000F0)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL1_ADDR, (REG_RPL_RD(RPL_RPLLCNTL1_ADDR) & ~((uint32_t)0x000000F0)) | ((uint32_t)rpllvcofc << 4));
}

__STATIC_FORCEINLINE uint8_t rpl_rpll_ivco_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x0000000C)) >> 2);
}

__STATIC_FORCEINLINE void rpl_rpll_ivco_setf(uint8_t rpllivco)
{
    ASSERT_ERR((((uint32_t)rpllivco << 2) & ~((uint32_t)0x0000000C)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL1_ADDR, (REG_RPL_RD(RPL_RPLLCNTL1_ADDR) & ~((uint32_t)0x0000000C)) | ((uint32_t)rpllivco << 2));
}

__STATIC_FORCEINLINE uint8_t rpl_rpll_vco_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00000003)) >> 0);
}

__STATIC_FORCEINLINE void rpl_rpll_vco_mode_setf(uint8_t rpllvcomode)
{
    ASSERT_ERR((((uint32_t)rpllvcomode << 0) & ~((uint32_t)0x00000003)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL1_ADDR, (REG_RPL_RD(RPL_RPLLCNTL1_ADDR) & ~((uint32_t)0x00000003)) | ((uint32_t)rpllvcomode << 0));
}

/**
 * @brief RPLLCNTL2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     21   RPLL_LD_FREF_INV_EN   0
 *     20   RPLL_LD_FDIV_INV_EN   0
 *  19:18      RPLL_EDGES_COMP   0x2
 *     17   RPLL_FE_DETECT_VAL   0
 *     16   RPLL_RE_DETECT_VAL   0
 *  11:08      RPLL_UNLOCK_CNT   0x3
 *  07:00        RPLL_LOCK_CNT   0x46
 * </pre>
 */
#define RPL_RPLLCNTL2_ADDR   0x0000001E
#define RPL_RPLLCNTL2_OFFSET 0x0000001E
#define RPL_RPLLCNTL2_INDEX  0x0000001E
#define RPL_RPLLCNTL2_RESET  0x00080346

__STATIC_FORCEINLINE uint32_t rpl_rpllcntl2_get(void)
{
    return REG_RPL_RD(RPL_RPLLCNTL2_ADDR);
}

__STATIC_FORCEINLINE void rpl_rpllcntl2_set(uint32_t value)
{
    REG_RPL_WR(RPL_RPLLCNTL2_ADDR, value);
}

// field definitions
#define RPL_RPLL_LD_FREF_INV_EN_BIT    ((uint32_t)0x00200000)
#define RPL_RPLL_LD_FREF_INV_EN_POS    21
#define RPL_RPLL_LD_FDIV_INV_EN_BIT    ((uint32_t)0x00100000)
#define RPL_RPLL_LD_FDIV_INV_EN_POS    20
#define RPL_RPLL_EDGES_COMP_MASK       ((uint32_t)0x000C0000)
#define RPL_RPLL_EDGES_COMP_LSB        18
#define RPL_RPLL_EDGES_COMP_WIDTH      ((uint32_t)0x00000002)
#define RPL_RPLL_FE_DETECT_VAL_BIT     ((uint32_t)0x00020000)
#define RPL_RPLL_FE_DETECT_VAL_POS     17
#define RPL_RPLL_RE_DETECT_VAL_BIT     ((uint32_t)0x00010000)
#define RPL_RPLL_RE_DETECT_VAL_POS     16
#define RPL_RPLL_UNLOCK_CNT_MASK       ((uint32_t)0x00000F00)
#define RPL_RPLL_UNLOCK_CNT_LSB        8
#define RPL_RPLL_UNLOCK_CNT_WIDTH      ((uint32_t)0x00000004)
#define RPL_RPLL_LOCK_CNT_MASK         ((uint32_t)0x000000FF)
#define RPL_RPLL_LOCK_CNT_LSB          0
#define RPL_RPLL_LOCK_CNT_WIDTH        ((uint32_t)0x00000008)

#define RPL_RPLL_LD_FREF_INV_EN_RST    0x0
#define RPL_RPLL_LD_FDIV_INV_EN_RST    0x0
#define RPL_RPLL_EDGES_COMP_RST        0x2
#define RPL_RPLL_FE_DETECT_VAL_RST     0x0
#define RPL_RPLL_RE_DETECT_VAL_RST     0x0
#define RPL_RPLL_UNLOCK_CNT_RST        0x3
#define RPL_RPLL_LOCK_CNT_RST          0x46

__STATIC_FORCEINLINE void rpl_rpllcntl2_pack(uint8_t rpllldfrefinven, uint8_t rpllldfdivinven, uint8_t rplledgescomp, uint8_t rpllfedetectval, uint8_t rpllredetectval, uint8_t rpllunlockcnt, uint8_t rplllockcnt)
{
    ASSERT_ERR((((uint32_t)rpllldfrefinven << 21) & ~((uint32_t)0x00200000)) == 0);
    ASSERT_ERR((((uint32_t)rpllldfdivinven << 20) & ~((uint32_t)0x00100000)) == 0);
    ASSERT_ERR((((uint32_t)rplledgescomp << 18) & ~((uint32_t)0x000C0000)) == 0);
    ASSERT_ERR((((uint32_t)rpllfedetectval << 17) & ~((uint32_t)0x00020000)) == 0);
    ASSERT_ERR((((uint32_t)rpllredetectval << 16) & ~((uint32_t)0x00010000)) == 0);
    ASSERT_ERR((((uint32_t)rpllunlockcnt << 8) & ~((uint32_t)0x00000F00)) == 0);
    ASSERT_ERR((((uint32_t)rplllockcnt << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL2_ADDR,  ((uint32_t)rpllldfrefinven << 21) | ((uint32_t)rpllldfdivinven << 20) | ((uint32_t)rplledgescomp << 18) | ((uint32_t)rpllfedetectval << 17) | ((uint32_t)rpllredetectval << 16) | ((uint32_t)rpllunlockcnt << 8) | ((uint32_t)rplllockcnt << 0));
}

__STATIC_FORCEINLINE void rpl_rpllcntl2_unpack(uint8_t* rpllldfrefinven, uint8_t* rpllldfdivinven, uint8_t* rplledgescomp, uint8_t* rpllfedetectval, uint8_t* rpllredetectval, uint8_t* rpllunlockcnt, uint8_t* rplllockcnt)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL2_ADDR);

    *rpllldfrefinven = (localVal & ((uint32_t)0x00200000)) >> 21;
    *rpllldfdivinven = (localVal & ((uint32_t)0x00100000)) >> 20;
    *rplledgescomp = (localVal & ((uint32_t)0x000C0000)) >> 18;
    *rpllfedetectval = (localVal & ((uint32_t)0x00020000)) >> 17;
    *rpllredetectval = (localVal & ((uint32_t)0x00010000)) >> 16;
    *rpllunlockcnt = (localVal & ((uint32_t)0x00000F00)) >> 8;
    *rplllockcnt = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_rpll_ld_fref_inv_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00200000)) >> 21);
}

__STATIC_FORCEINLINE void rpl_rpll_ld_fref_inv_en_setf(uint8_t rpllldfrefinven)
{
    ASSERT_ERR((((uint32_t)rpllldfrefinven << 21) & ~((uint32_t)0x00200000)) == 0);
    REG_RPL_WR(RPL_RPLLCNTL2_ADDR, (REG_RPL_RD(RPL_RPLLCNTL2_ADDR) & ~((uint32_t)0x00200000)) | ((uint32_t)rpllldfrefinven << 21));
}

__STATIC_FORCEINLINE uint8_t rpl_rpll_ld_fdiv_inv_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00100000)) >> 20);
}

