tyh21/da14585_420/da14585_420_Paged_Clock/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE void rpl_fmtx_en_setf(uint8_t fmtxen)
{
    ASSERT_ERR((((uint32_t)fmtxen << 4) & ~((uint32_t)0x00000010)) == 0);
    REG_RPL_WR(RPL_RPLLSDCNTL2_ADDR, (REG_RPL_RD(RPL_RPLLSDCNTL2_ADDR) & ~((uint32_t)0x00000010)) | ((uint32_t)fmtxen << 4));
}

__STATIC_FORCEINLINE uint8_t rpl_sddither_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLSDCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__STATIC_FORCEINLINE void rpl_sddither_en_setf(uint8_t sdditheren)
{
    ASSERT_ERR((((uint32_t)sdditheren << 3) & ~((uint32_t)0x00000008)) == 0);
    REG_RPL_WR(RPL_RPLLSDCNTL2_ADDR, (REG_RPL_RD(RPL_RPLLSDCNTL2_ADDR) & ~((uint32_t)0x00000008)) | ((uint32_t)sdditheren << 3));
}

__STATIC_FORCEINLINE uint8_t rpl_rpll_sdorder_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLSDCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00000006)) >> 1);
}

__STATIC_FORCEINLINE void rpl_rpll_sdorder_setf(uint8_t rpllsdorder)
{
    ASSERT_ERR((((uint32_t)rpllsdorder << 1) & ~((uint32_t)0x00000006)) == 0);
    REG_RPL_WR(RPL_RPLLSDCNTL2_ADDR, (REG_RPL_RD(RPL_RPLLSDCNTL2_ADDR) & ~((uint32_t)0x00000006)) | ((uint32_t)rpllsdorder << 1));
}

__STATIC_FORCEINLINE uint8_t rpl_rpll_frac_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLSDCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__STATIC_FORCEINLINE void rpl_rpll_frac_en_setf(uint8_t rpllfracen)
{
    ASSERT_ERR((((uint32_t)rpllfracen << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_RPLLSDCNTL2_ADDR, (REG_RPL_RD(RPL_RPLLSDCNTL2_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)rpllfracen << 0));
}

/**
 * @brief RPLLSDSTAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:08          RPLL_NFRACT   0x0
 *  07:00            RPLL_NINT   0x0
 * </pre>
 */
#define RPL_RPLLSDSTAT_ADDR   0x00000023
#define RPL_RPLLSDSTAT_OFFSET 0x00000023
#define RPL_RPLLSDSTAT_INDEX  0x00000023
#define RPL_RPLLSDSTAT_RESET  0x00000000

__STATIC_FORCEINLINE uint32_t rpl_rpllsdstat_get(void)
{
    return REG_RPL_RD(RPL_RPLLSDSTAT_ADDR);
}

// field definitions
#define RPL_RPLL_NFRACT_MASK   ((uint32_t)0xFFFFFF00)
#define RPL_RPLL_NFRACT_LSB    8
#define RPL_RPLL_NFRACT_WIDTH  ((uint32_t)0x00000018)
#define RPL_RPLL_NINT_MASK     ((uint32_t)0x000000FF)
#define RPL_RPLL_NINT_LSB      0
#define RPL_RPLL_NINT_WIDTH    ((uint32_t)0x00000008)

#define RPL_RPLL_NFRACT_RST    0x0
#define RPL_RPLL_NINT_RST      0x0

__STATIC_FORCEINLINE void rpl_rpllsdstat_unpack(uint32_t* rpllnfract, uint8_t* rpllnint)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLSDSTAT_ADDR);

    *rpllnfract = (localVal & ((uint32_t)0xFFFFFF00)) >> 8;
    *rpllnint = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__STATIC_FORCEINLINE uint32_t rpl_rpll_nfract_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLSDSTAT_ADDR);
    return ((localVal & ((uint32_t)0xFFFFFF00)) >> 8);
}

__STATIC_FORCEINLINE uint8_t rpl_rpll_nint_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLSDSTAT_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

/**
 * @brief RPLLMASH_INIT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:24            MASH_SDI4   0xD
 *  23:16            MASH_SDI3   0xB
 *  15:08            MASH_SDI2   0x13
 *  07:00            MASH_SDI1   0x11
 * </pre>
 */
#define RPL_RPLLMASH_INIT_ADDR   0x00000024
#define RPL_RPLLMASH_INIT_OFFSET 0x00000024
#define RPL_RPLLMASH_INIT_INDEX  0x00000024
#define RPL_RPLLMASH_INIT_RESET  0x0D0B1311

__STATIC_FORCEINLINE uint32_t rpl_rpllmash_init_get(void)
{
    return REG_RPL_RD(RPL_RPLLMASH_INIT_ADDR);
}

__STATIC_FORCEINLINE void rpl_rpllmash_init_set(uint32_t value)
{
    REG_RPL_WR(RPL_RPLLMASH_INIT_ADDR, value);
}

// field definitions
#define RPL_MASH_SDI4_MASK   ((uint32_t)0xFF000000)
#define RPL_MASH_SDI4_LSB    24
#define RPL_MASH_SDI4_WIDTH  ((uint32_t)0x00000008)
#define RPL_MASH_SDI3_MASK   ((uint32_t)0x00FF0000)
#define RPL_MASH_SDI3_LSB    16
#define RPL_MASH_SDI3_WIDTH  ((uint32_t)0x00000008)
#define RPL_MASH_SDI2_MASK   ((uint32_t)0x0000FF00)
#define RPL_MASH_SDI2_LSB    8
#define RPL_MASH_SDI2_WIDTH  ((uint32_t)0x00000008)
#define RPL_MASH_SDI1_MASK   ((uint32_t)0x000000FF)
#define RPL_MASH_SDI1_LSB    0
#define RPL_MASH_SDI1_WIDTH  ((uint32_t)0x00000008)

#define RPL_MASH_SDI4_RST    0xD
#define RPL_MASH_SDI3_RST    0xB
#define RPL_MASH_SDI2_RST    0x13
#define RPL_MASH_SDI1_RST    0x11

__STATIC_FORCEINLINE void rpl_rpllmash_init_pack(uint8_t mashsdi4, uint8_t mashsdi3, uint8_t mashsdi2, uint8_t mashsdi1)
{
    ASSERT_ERR((((uint32_t)mashsdi4 << 24) & ~((uint32_t)0xFF000000)) == 0);
    ASSERT_ERR((((uint32_t)mashsdi3 << 16) & ~((uint32_t)0x00FF0000)) == 0);
    ASSERT_ERR((((uint32_t)mashsdi2 << 8) & ~((uint32_t)0x0000FF00)) == 0);
    ASSERT_ERR((((uint32_t)mashsdi1 << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_RPLLMASH_INIT_ADDR,  ((uint32_t)mashsdi4 << 24) | ((uint32_t)mashsdi3 << 16) | ((uint32_t)mashsdi2 << 8) | ((uint32_t)mashsdi1 << 0));
}

__STATIC_FORCEINLINE void rpl_rpllmash_init_unpack(uint8_t* mashsdi4, uint8_t* mashsdi3, uint8_t* mashsdi2, uint8_t* mashsdi1)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLMASH_INIT_ADDR);

    *mashsdi4 = (localVal & ((uint32_t)0xFF000000)) >> 24;
    *mashsdi3 = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *mashsdi2 = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *mashsdi1 = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_mash_sdi4_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLMASH_INIT_ADDR);
    return ((localVal & ((uint32_t)0xFF000000)) >> 24);
}

__STATIC_FORCEINLINE void rpl_mash_sdi4_setf(uint8_t mashsdi4)
{
    ASSERT_ERR((((uint32_t)mashsdi4 << 24) & ~((uint32_t)0xFF000000)) == 0);
    REG_RPL_WR(RPL_RPLLMASH_INIT_ADDR, (REG_RPL_RD(RPL_RPLLMASH_INIT_ADDR) & ~((uint32_t)0xFF000000)) | ((uint32_t)mashsdi4 << 24));
}

__STATIC_FORCEINLINE uint8_t rpl_mash_sdi3_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLMASH_INIT_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

__STATIC_FORCEINLINE void rpl_mash_sdi3_setf(uint8_t mashsdi3)
{
    ASSERT_ERR((((uint32_t)mashsdi3 << 16) & ~((uint32_t)0x00FF0000)) == 0);
    REG_RPL_WR(RPL_RPLLMASH_INIT_ADDR, (REG_RPL_RD(RPL_RPLLMASH_INIT_ADDR) & ~((uint32_t)0x00FF0000)) | ((uint32_t)mashsdi3 << 16));
}

__STATIC_FORCEINLINE uint8_t rpl_mash_sdi2_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLMASH_INIT_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

