tyh21/da14585_420/da14585_420_Paged_Clock/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE void rpl_dpllcntl3_unpack(uint8_t* dpllldfrefclkinven, uint8_t* dpllldfdivclkinven, uint8_t* dpllldedgescomb, uint8_t* dpllldfe, uint8_t* dpllldre, uint8_t* dpllldunlockcnt, uint8_t* dpllldlockcnt)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL3_ADDR);

    *dpllldfrefclkinven = (localVal & ((uint32_t)0x00200000)) >> 21;
    *dpllldfdivclkinven = (localVal & ((uint32_t)0x00100000)) >> 20;
    *dpllldedgescomb = (localVal & ((uint32_t)0x000C0000)) >> 18;
    *dpllldfe = (localVal & ((uint32_t)0x00020000)) >> 17;
    *dpllldre = (localVal & ((uint32_t)0x00010000)) >> 16;
    *dpllldunlockcnt = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *dpllldlockcnt = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_dpll_ld_fref_clk_inv_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x00200000)) >> 21);
}

__STATIC_FORCEINLINE void rpl_dpll_ld_fref_clk_inv_en_setf(uint8_t dpllldfrefclkinven)
{
    ASSERT_ERR((((uint32_t)dpllldfrefclkinven << 21) & ~((uint32_t)0x00200000)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL3_ADDR, (REG_RPL_RD(RPL_DPLLCNTL3_ADDR) & ~((uint32_t)0x00200000)) | ((uint32_t)dpllldfrefclkinven << 21));
}

__STATIC_FORCEINLINE uint8_t rpl_dpll_ld_fdiv_clk_inv_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x00100000)) >> 20);
}

__STATIC_FORCEINLINE void rpl_dpll_ld_fdiv_clk_inv_en_setf(uint8_t dpllldfdivclkinven)
{
    ASSERT_ERR((((uint32_t)dpllldfdivclkinven << 20) & ~((uint32_t)0x00100000)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL3_ADDR, (REG_RPL_RD(RPL_DPLLCNTL3_ADDR) & ~((uint32_t)0x00100000)) | ((uint32_t)dpllldfdivclkinven << 20));
}

__STATIC_FORCEINLINE uint8_t rpl_dpll_ld_edges_comb_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x000C0000)) >> 18);
}

__STATIC_FORCEINLINE void rpl_dpll_ld_edges_comb_setf(uint8_t dpllldedgescomb)
{
    ASSERT_ERR((((uint32_t)dpllldedgescomb << 18) & ~((uint32_t)0x000C0000)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL3_ADDR, (REG_RPL_RD(RPL_DPLLCNTL3_ADDR) & ~((uint32_t)0x000C0000)) | ((uint32_t)dpllldedgescomb << 18));
}

__STATIC_FORCEINLINE uint8_t rpl_dpll_ld_fe_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x00020000)) >> 17);
}

__STATIC_FORCEINLINE void rpl_dpll_ld_fe_setf(uint8_t dpllldfe)
{
    ASSERT_ERR((((uint32_t)dpllldfe << 17) & ~((uint32_t)0x00020000)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL3_ADDR, (REG_RPL_RD(RPL_DPLLCNTL3_ADDR) & ~((uint32_t)0x00020000)) | ((uint32_t)dpllldfe << 17));
}

__STATIC_FORCEINLINE uint8_t rpl_dpll_ld_re_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x00010000)) >> 16);
}

__STATIC_FORCEINLINE void rpl_dpll_ld_re_setf(uint8_t dpllldre)
{
    ASSERT_ERR((((uint32_t)dpllldre << 16) & ~((uint32_t)0x00010000)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL3_ADDR, (REG_RPL_RD(RPL_DPLLCNTL3_ADDR) & ~((uint32_t)0x00010000)) | ((uint32_t)dpllldre << 16));
}

__STATIC_FORCEINLINE uint8_t rpl_dpll_ld_unlock_cnt_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

__STATIC_FORCEINLINE void rpl_dpll_ld_unlock_cnt_setf(uint8_t dpllldunlockcnt)
{
    ASSERT_ERR((((uint32_t)dpllldunlockcnt << 8) & ~((uint32_t)0x0000FF00)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL3_ADDR, (REG_RPL_RD(RPL_DPLLCNTL3_ADDR) & ~((uint32_t)0x0000FF00)) | ((uint32_t)dpllldunlockcnt << 8));
}

__STATIC_FORCEINLINE uint8_t rpl_dpll_ld_lock_cnt_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__STATIC_FORCEINLINE void rpl_dpll_ld_lock_cnt_setf(uint8_t dpllldlockcnt)
{
    ASSERT_ERR((((uint32_t)dpllldlockcnt << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL3_ADDR, (REG_RPL_RD(RPL_DPLLCNTL3_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)dpllldlockcnt << 0));
}

/**
 * @brief DPLLSTAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     01      DPLL_VCO_CLK_OK   0
 *     00     DPLL_LOCK_DETECT   0
 * </pre>
 */
#define RPL_DPLLSTAT_ADDR   0x00000036
#define RPL_DPLLSTAT_OFFSET 0x00000036
#define RPL_DPLLSTAT_INDEX  0x00000036
#define RPL_DPLLSTAT_RESET  0x00000000

__STATIC_FORCEINLINE uint32_t rpl_dpllstat_get(void)
{
    return REG_RPL_RD(RPL_DPLLSTAT_ADDR);
}

// field definitions
#define RPL_DPLL_VCO_CLK_OK_BIT     ((uint32_t)0x00000002)
#define RPL_DPLL_VCO_CLK_OK_POS     1
#define RPL_DPLL_LOCK_DETECT_BIT    ((uint32_t)0x00000001)
#define RPL_DPLL_LOCK_DETECT_POS    0

#define RPL_DPLL_VCO_CLK_OK_RST     0x0
#define RPL_DPLL_LOCK_DETECT_RST    0x0

__STATIC_FORCEINLINE void rpl_dpllstat_unpack(uint8_t* dpllvcoclkok, uint8_t* dplllockdetect)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLSTAT_ADDR);

    *dpllvcoclkok = (localVal & ((uint32_t)0x00000002)) >> 1;
    *dplllockdetect = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_dpll_vco_clk_ok_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__STATIC_FORCEINLINE uint8_t rpl_dpll_lock_detect_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

/**
 * @brief RC_CALIB_CNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:28          FILT_RC_VAL   0x0
 *  27:24          RPLL_RC_VAL   0x0
 *  21:16          DPLL_RC_VAL   0x0
 *     11    FILT_RCCAL_CLK_EN   0
 *     10    RPLL_RCCAL_CLK_EN   0
 *     09    DPLL_RCCAL_CLK_EN   0
 *     08      FILT_RCCAL_NOSC   0
 *     07      RPLL_RCCAL_NOSC   0
 *     06      DPLL_RCCAL_NOSC   0
 *     02        FILT_RCCAL_ON   0
 *     01        RPLL_RCCAL_ON   0
 *     00        DPLL_RCCAL_ON   0
 * </pre>
 */
#define RPL_RC_CALIB_CNTL_ADDR   0x00000037
#define RPL_RC_CALIB_CNTL_OFFSET 0x00000037
#define RPL_RC_CALIB_CNTL_INDEX  0x00000037
#define RPL_RC_CALIB_CNTL_RESET  0x00000000

__STATIC_FORCEINLINE uint32_t rpl_rc_calib_cntl_get(void)
{
    return REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR);
}

