tyh21/da14585_420/da14585_420_Paged_Clock/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE void rpl_rc_calib_cntl_set(uint32_t value)
{
    REG_RPL_WR(RPL_RC_CALIB_CNTL_ADDR, value);
}

// field definitions
#define RPL_FILT_RC_VAL_MASK         ((uint32_t)0xF0000000)
#define RPL_FILT_RC_VAL_LSB          28
#define RPL_FILT_RC_VAL_WIDTH        ((uint32_t)0x00000004)
#define RPL_RPLL_RC_VAL_MASK         ((uint32_t)0x0F000000)
#define RPL_RPLL_RC_VAL_LSB          24
#define RPL_RPLL_RC_VAL_WIDTH        ((uint32_t)0x00000004)
#define RPL_DPLL_RC_VAL_MASK         ((uint32_t)0x003F0000)
#define RPL_DPLL_RC_VAL_LSB          16
#define RPL_DPLL_RC_VAL_WIDTH        ((uint32_t)0x00000006)
#define RPL_FILT_RCCAL_CLK_EN_BIT    ((uint32_t)0x00000800)
#define RPL_FILT_RCCAL_CLK_EN_POS    11
#define RPL_RPLL_RCCAL_CLK_EN_BIT    ((uint32_t)0x00000400)
#define RPL_RPLL_RCCAL_CLK_EN_POS    10
#define RPL_DPLL_RCCAL_CLK_EN_BIT    ((uint32_t)0x00000200)
#define RPL_DPLL_RCCAL_CLK_EN_POS    9
#define RPL_FILT_RCCAL_NOSC_BIT      ((uint32_t)0x00000100)
#define RPL_FILT_RCCAL_NOSC_POS      8
#define RPL_RPLL_RCCAL_NOSC_BIT      ((uint32_t)0x00000080)
#define RPL_RPLL_RCCAL_NOSC_POS      7
#define RPL_DPLL_RCCAL_NOSC_BIT      ((uint32_t)0x00000040)
#define RPL_DPLL_RCCAL_NOSC_POS      6
#define RPL_FILT_RCCAL_ON_BIT        ((uint32_t)0x00000004)
#define RPL_FILT_RCCAL_ON_POS        2
#define RPL_RPLL_RCCAL_ON_BIT        ((uint32_t)0x00000002)
#define RPL_RPLL_RCCAL_ON_POS        1
#define RPL_DPLL_RCCAL_ON_BIT        ((uint32_t)0x00000001)
#define RPL_DPLL_RCCAL_ON_POS        0

#define RPL_FILT_RC_VAL_RST          0x0
#define RPL_RPLL_RC_VAL_RST          0x0
#define RPL_DPLL_RC_VAL_RST          0x0
#define RPL_FILT_RCCAL_CLK_EN_RST    0x0
#define RPL_RPLL_RCCAL_CLK_EN_RST    0x0
#define RPL_DPLL_RCCAL_CLK_EN_RST    0x0
#define RPL_FILT_RCCAL_NOSC_RST      0x0
#define RPL_RPLL_RCCAL_NOSC_RST      0x0
#define RPL_DPLL_RCCAL_NOSC_RST      0x0
#define RPL_FILT_RCCAL_ON_RST        0x0
#define RPL_RPLL_RCCAL_ON_RST        0x0
#define RPL_DPLL_RCCAL_ON_RST        0x0

__STATIC_FORCEINLINE void rpl_rc_calib_cntl_pack(uint8_t filtrcval, uint8_t rpllrcval, uint8_t dpllrcval, uint8_t filtrccalclken, uint8_t rpllrccalclken, uint8_t dpllrccalclken, uint8_t filtrccalnosc, uint8_t rpllrccalnosc, uint8_t dpllrccalnosc, uint8_t filtrccalon, uint8_t rpllrccalon, uint8_t dpllrccalon)
{
    ASSERT_ERR((((uint32_t)filtrcval << 28) & ~((uint32_t)0xF0000000)) == 0);
    ASSERT_ERR((((uint32_t)rpllrcval << 24) & ~((uint32_t)0x0F000000)) == 0);
    ASSERT_ERR((((uint32_t)dpllrcval << 16) & ~((uint32_t)0x003F0000)) == 0);
    ASSERT_ERR((((uint32_t)filtrccalclken << 11) & ~((uint32_t)0x00000800)) == 0);
    ASSERT_ERR((((uint32_t)rpllrccalclken << 10) & ~((uint32_t)0x00000400)) == 0);
    ASSERT_ERR((((uint32_t)dpllrccalclken << 9) & ~((uint32_t)0x00000200)) == 0);
    ASSERT_ERR((((uint32_t)filtrccalnosc << 8) & ~((uint32_t)0x00000100)) == 0);
    ASSERT_ERR((((uint32_t)rpllrccalnosc << 7) & ~((uint32_t)0x00000080)) == 0);
    ASSERT_ERR((((uint32_t)dpllrccalnosc << 6) & ~((uint32_t)0x00000040)) == 0);
    ASSERT_ERR((((uint32_t)filtrccalon << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)rpllrccalon << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)dpllrccalon << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_RC_CALIB_CNTL_ADDR,  ((uint32_t)filtrcval << 28) | ((uint32_t)rpllrcval << 24) | ((uint32_t)dpllrcval << 16) | ((uint32_t)filtrccalclken << 11) | ((uint32_t)rpllrccalclken << 10) | ((uint32_t)dpllrccalclken << 9) | ((uint32_t)filtrccalnosc << 8) | ((uint32_t)rpllrccalnosc << 7) | ((uint32_t)dpllrccalnosc << 6) | ((uint32_t)filtrccalon << 2) | ((uint32_t)rpllrccalon << 1) | ((uint32_t)dpllrccalon << 0));
}

__STATIC_FORCEINLINE void rpl_rc_calib_cntl_unpack(uint8_t* filtrcval, uint8_t* rpllrcval, uint8_t* dpllrcval, uint8_t* filtrccalclken, uint8_t* rpllrccalclken, uint8_t* dpllrccalclken, uint8_t* filtrccalnosc, uint8_t* rpllrccalnosc, uint8_t* dpllrccalnosc, uint8_t* filtrccalon, uint8_t* rpllrccalon, uint8_t* dpllrccalon)
{
    uint32_t localVal = REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR);

    *filtrcval = (localVal & ((uint32_t)0xF0000000)) >> 28;
    *rpllrcval = (localVal & ((uint32_t)0x0F000000)) >> 24;
    *dpllrcval = (localVal & ((uint32_t)0x003F0000)) >> 16;
    *filtrccalclken = (localVal & ((uint32_t)0x00000800)) >> 11;
    *rpllrccalclken = (localVal & ((uint32_t)0x00000400)) >> 10;
    *dpllrccalclken = (localVal & ((uint32_t)0x00000200)) >> 9;
    *filtrccalnosc = (localVal & ((uint32_t)0x00000100)) >> 8;
    *rpllrccalnosc = (localVal & ((uint32_t)0x00000080)) >> 7;
    *dpllrccalnosc = (localVal & ((uint32_t)0x00000040)) >> 6;
    *filtrccalon = (localVal & ((uint32_t)0x00000004)) >> 2;
    *rpllrccalon = (localVal & ((uint32_t)0x00000002)) >> 1;
    *dpllrccalon = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_filt_rc_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR);
    return ((localVal & ((uint32_t)0xF0000000)) >> 28);
}

__STATIC_FORCEINLINE void rpl_filt_rc_val_setf(uint8_t filtrcval)
{
    ASSERT_ERR((((uint32_t)filtrcval << 28) & ~((uint32_t)0xF0000000)) == 0);
    REG_RPL_WR(RPL_RC_CALIB_CNTL_ADDR, (REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR) & ~((uint32_t)0xF0000000)) | ((uint32_t)filtrcval << 28));
}

__STATIC_FORCEINLINE uint8_t rpl_rpll_rc_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x0F000000)) >> 24);
}

__STATIC_FORCEINLINE void rpl_rpll_rc_val_setf(uint8_t rpllrcval)
{
    ASSERT_ERR((((uint32_t)rpllrcval << 24) & ~((uint32_t)0x0F000000)) == 0);
    REG_RPL_WR(RPL_RC_CALIB_CNTL_ADDR, (REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR) & ~((uint32_t)0x0F000000)) | ((uint32_t)rpllrcval << 24));
}

__STATIC_FORCEINLINE uint8_t rpl_dpll_rc_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x003F0000)) >> 16);
}

__STATIC_FORCEINLINE void rpl_dpll_rc_val_setf(uint8_t dpllrcval)
{
    ASSERT_ERR((((uint32_t)dpllrcval << 16) & ~((uint32_t)0x003F0000)) == 0);
    REG_RPL_WR(RPL_RC_CALIB_CNTL_ADDR, (REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR) & ~((uint32_t)0x003F0000)) | ((uint32_t)dpllrcval << 16));
}

__STATIC_FORCEINLINE uint8_t rpl_filt_rccal_clk_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000800)) >> 11);
}

__STATIC_FORCEINLINE void rpl_filt_rccal_clk_en_setf(uint8_t filtrccalclken)
{
    ASSERT_ERR((((uint32_t)filtrccalclken << 11) & ~((uint32_t)0x00000800)) == 0);
    REG_RPL_WR(RPL_RC_CALIB_CNTL_ADDR, (REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR) & ~((uint32_t)0x00000800)) | ((uint32_t)filtrccalclken << 11));
}

__STATIC_FORCEINLINE uint8_t rpl_rpll_rccal_clk_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000400)) >> 10);
}

