tyh21/da14585_420/da14585_420_Paged_Clock/sdk/platform/driver/ble/reg_ripple.h
// field definitions
#define RPL_KVCOSTEP_DEN_MASK   ((uint32_t)0x07000000)
#define RPL_KVCOSTEP_DEN_LSB    24
#define RPL_KVCOSTEP_DEN_WIDTH  ((uint32_t)0x00000003)
#define RPL_KVCOSTEP_NUM_MASK   ((uint32_t)0x00FF0000)
#define RPL_KVCOSTEP_NUM_LSB    16
#define RPL_KVCOSTEP_NUM_WIDTH  ((uint32_t)0x00000008)
#define RPL_ICPCALSIGN_BIT      ((uint32_t)0x00001000)
#define RPL_ICPCALSIGN_POS      12
#define RPL_KVCO_REF_MASK       ((uint32_t)0x000003FF)
#define RPL_KVCO_REF_LSB        0
#define RPL_KVCO_REF_WIDTH      ((uint32_t)0x0000000A)

#define RPL_KVCOSTEP_DEN_RST    0x6
#define RPL_KVCOSTEP_NUM_RST    0x3
#define RPL_ICPCALSIGN_RST      0x0
#define RPL_KVCO_REF_RST        0x1AB

__STATIC_FORCEINLINE void rpl_vcofc_icp_calibconfig_pack(uint8_t kvcostepden, uint8_t kvcostepnum, uint8_t icpcalsign, uint16_t kvcoref)
{
    ASSERT_ERR((((uint32_t)kvcostepden << 24) & ~((uint32_t)0x07000000)) == 0);
    ASSERT_ERR((((uint32_t)kvcostepnum << 16) & ~((uint32_t)0x00FF0000)) == 0);
    ASSERT_ERR((((uint32_t)icpcalsign << 12) & ~((uint32_t)0x00001000)) == 0);
    ASSERT_ERR((((uint32_t)kvcoref << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_VCOFC_ICP_CALIBCONFIG_ADDR,  ((uint32_t)kvcostepden << 24) | ((uint32_t)kvcostepnum << 16) | ((uint32_t)icpcalsign << 12) | ((uint32_t)kvcoref << 0));
}

__STATIC_FORCEINLINE void rpl_vcofc_icp_calibconfig_unpack(uint8_t* kvcostepden, uint8_t* kvcostepnum, uint8_t* icpcalsign, uint16_t* kvcoref)
{
    uint32_t localVal = REG_RPL_RD(RPL_VCOFC_ICP_CALIBCONFIG_ADDR);

    *kvcostepden = (localVal & ((uint32_t)0x07000000)) >> 24;
    *kvcostepnum = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *icpcalsign = (localVal & ((uint32_t)0x00001000)) >> 12;
    *kvcoref = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_kvcostep_den_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_VCOFC_ICP_CALIBCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x07000000)) >> 24);
}

__STATIC_FORCEINLINE void rpl_kvcostep_den_setf(uint8_t kvcostepden)
{
    ASSERT_ERR((((uint32_t)kvcostepden << 24) & ~((uint32_t)0x07000000)) == 0);
    REG_RPL_WR(RPL_VCOFC_ICP_CALIBCONFIG_ADDR, (REG_RPL_RD(RPL_VCOFC_ICP_CALIBCONFIG_ADDR) & ~((uint32_t)0x07000000)) | ((uint32_t)kvcostepden << 24));
}

__STATIC_FORCEINLINE uint8_t rpl_kvcostep_num_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_VCOFC_ICP_CALIBCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

__STATIC_FORCEINLINE void rpl_kvcostep_num_setf(uint8_t kvcostepnum)
{
    ASSERT_ERR((((uint32_t)kvcostepnum << 16) & ~((uint32_t)0x00FF0000)) == 0);
    REG_RPL_WR(RPL_VCOFC_ICP_CALIBCONFIG_ADDR, (REG_RPL_RD(RPL_VCOFC_ICP_CALIBCONFIG_ADDR) & ~((uint32_t)0x00FF0000)) | ((uint32_t)kvcostepnum << 16));
}

__STATIC_FORCEINLINE uint8_t rpl_icpcalsign_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_VCOFC_ICP_CALIBCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x00001000)) >> 12);
}

__STATIC_FORCEINLINE void rpl_icpcalsign_setf(uint8_t icpcalsign)
{
    ASSERT_ERR((((uint32_t)icpcalsign << 12) & ~((uint32_t)0x00001000)) == 0);
    REG_RPL_WR(RPL_VCOFC_ICP_CALIBCONFIG_ADDR, (REG_RPL_RD(RPL_VCOFC_ICP_CALIBCONFIG_ADDR) & ~((uint32_t)0x00001000)) | ((uint32_t)icpcalsign << 12));
}

__STATIC_FORCEINLINE uint16_t rpl_kvco_ref_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_VCOFC_ICP_CALIBCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

__STATIC_FORCEINLINE void rpl_kvco_ref_setf(uint16_t kvcoref)
{
    ASSERT_ERR((((uint32_t)kvcoref << 0) & ~((uint32_t)0x000003FF)) == 0);
    REG_RPL_WR(RPL_VCOFC_ICP_CALIBCONFIG_ADDR, (REG_RPL_RD(RPL_VCOFC_ICP_CALIBCONFIG_ADDR) & ~((uint32_t)0x000003FF)) | ((uint32_t)kvcoref << 0));
}

/**
 * @brief VCOFC_ICP_CALIBSTAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     08           LUT_LD_VAL   0
 *  07:04          LUT_ICP_VAL   0x0
 *  03:00        LUT_VCOFC_VAL   0x0
 * </pre>
 */
#define RPL_VCOFC_ICP_CALIBSTAT_ADDR   0x0000003C
#define RPL_VCOFC_ICP_CALIBSTAT_OFFSET 0x0000003C
#define RPL_VCOFC_ICP_CALIBSTAT_INDEX  0x0000003C
#define RPL_VCOFC_ICP_CALIBSTAT_RESET  0x00000000

__STATIC_FORCEINLINE uint32_t rpl_vcofc_icp_calibstat_get(void)
{
    return REG_RPL_RD(RPL_VCOFC_ICP_CALIBSTAT_ADDR);
}

// field definitions
#define RPL_LUT_LD_VAL_BIT       ((uint32_t)0x00000100)
#define RPL_LUT_LD_VAL_POS       8
#define RPL_LUT_ICP_VAL_MASK     ((uint32_t)0x000000F0)
#define RPL_LUT_ICP_VAL_LSB      4
#define RPL_LUT_ICP_VAL_WIDTH    ((uint32_t)0x00000004)
#define RPL_LUT_VCOFC_VAL_MASK   ((uint32_t)0x0000000F)
#define RPL_LUT_VCOFC_VAL_LSB    0
#define RPL_LUT_VCOFC_VAL_WIDTH  ((uint32_t)0x00000004)

#define RPL_LUT_LD_VAL_RST       0x0
#define RPL_LUT_ICP_VAL_RST      0x0
#define RPL_LUT_VCOFC_VAL_RST    0x0

__STATIC_FORCEINLINE void rpl_vcofc_icp_calibstat_unpack(uint8_t* lutldval, uint8_t* luticpval, uint8_t* lutvcofcval)
{
    uint32_t localVal = REG_RPL_RD(RPL_VCOFC_ICP_CALIBSTAT_ADDR);

    *lutldval = (localVal & ((uint32_t)0x00000100)) >> 8;
    *luticpval = (localVal & ((uint32_t)0x000000F0)) >> 4;
    *lutvcofcval = (localVal & ((uint32_t)0x0000000F)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_lut_ld_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_VCOFC_ICP_CALIBSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

__STATIC_FORCEINLINE uint8_t rpl_lut_icp_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_VCOFC_ICP_CALIBSTAT_ADDR);
    return ((localVal & ((uint32_t)0x000000F0)) >> 4);
}

__STATIC_FORCEINLINE uint8_t rpl_lut_vcofc_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_VCOFC_ICP_CALIBSTAT_ADDR);
    return ((localVal & ((uint32_t)0x0000000F)) >> 0);
}

/**
 * @brief TXDC_CALIBCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  30:28         LUT_TXDC_SEL   0x0
 *  20:16         LUT_TXDCQ_IN   0x0
 *  12:08         LUT_TXDCI_IN   0x0
 *     04         LUT_TXDC_WEN   0
 *  03:00         LUT_TXDC_ADD   0x0
 * </pre>
 */
#define RPL_TXDC_CALIBCNTL_ADDR   0x0000003D
#define RPL_TXDC_CALIBCNTL_OFFSET 0x0000003D
#define RPL_TXDC_CALIBCNTL_INDEX  0x0000003D
#define RPL_TXDC_CALIBCNTL_RESET  0x00000000

