tyh21/da14585_420/da14585_420_Paged_Clock/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE uint8_t rpl_txctrl_force_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__STATIC_FORCEINLINE void rpl_txctrl_force_setf(uint8_t txctrlforce)
{
    ASSERT_ERR((((uint32_t)txctrlforce << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)txctrlforce << 31));
}

__STATIC_FORCEINLINE uint8_t rpl_txgain_gfsk_force_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x40000000)) >> 30);
}

__STATIC_FORCEINLINE void rpl_txgain_gfsk_force_setf(uint8_t txgaingfskforce)
{
    ASSERT_ERR((((uint32_t)txgaingfskforce << 30) & ~((uint32_t)0x40000000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x40000000)) | ((uint32_t)txgaingfskforce << 30));
}

__STATIC_FORCEINLINE uint8_t rpl_txgain_edr_force_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x20000000)) >> 29);
}

__STATIC_FORCEINLINE void rpl_txgain_edr_force_setf(uint8_t txgainedrforce)
{
    ASSERT_ERR((((uint32_t)txgainedrforce << 29) & ~((uint32_t)0x20000000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x20000000)) | ((uint32_t)txgainedrforce << 29));
}

__STATIC_FORCEINLINE uint8_t rpl_txdac_clk_inv_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x08000000)) >> 27);
}

__STATIC_FORCEINLINE void rpl_txdac_clk_inv_en_setf(uint8_t txdacclkinven)
{
    ASSERT_ERR((((uint32_t)txdacclkinven << 27) & ~((uint32_t)0x08000000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x08000000)) | ((uint32_t)txdacclkinven << 27));
}

__STATIC_FORCEINLINE uint8_t rpl_txdc_cal_timeout_dsb_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x04000000)) >> 26);
}

__STATIC_FORCEINLINE void rpl_txdc_cal_timeout_dsb_setf(uint8_t txdccaltimeoutdsb)
{
    ASSERT_ERR((((uint32_t)txdccaltimeoutdsb << 26) & ~((uint32_t)0x04000000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x04000000)) | ((uint32_t)txdccaltimeoutdsb << 26));
}

__STATIC_FORCEINLINE uint8_t rpl_txdc_cal_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x02000000)) >> 25);
}

__STATIC_FORCEINLINE void rpl_txdc_cal_en_setf(uint8_t txdccalen)
{
    ASSERT_ERR((((uint32_t)txdccalen << 25) & ~((uint32_t)0x02000000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x02000000)) | ((uint32_t)txdccalen << 25));
}

__STATIC_FORCEINLINE uint8_t rpl_txdc_cal_start_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x01000000)) >> 24);
}

__STATIC_FORCEINLINE void rpl_txdc_cal_start_setf(uint8_t txdccalstart)
{
    ASSERT_ERR((((uint32_t)txdccalstart << 24) & ~((uint32_t)0x01000000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x01000000)) | ((uint32_t)txdccalstart << 24));
}

__STATIC_FORCEINLINE uint8_t rpl_sd_fifo_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00200000)) >> 21);
}

__STATIC_FORCEINLINE void rpl_sd_fifo_en_setf(uint8_t sdfifoen)
{
    ASSERT_ERR((((uint32_t)sdfifoen << 21) & ~((uint32_t)0x00200000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00200000)) | ((uint32_t)sdfifoen << 21));
}

__STATIC_FORCEINLINE uint8_t rpl_ramp_gen_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00100000)) >> 20);
}

__STATIC_FORCEINLINE void rpl_ramp_gen_en_setf(uint8_t rampgenen)
{
    ASSERT_ERR((((uint32_t)rampgenen << 20) & ~((uint32_t)0x00100000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00100000)) | ((uint32_t)rampgenen << 20));
}

__STATIC_FORCEINLINE uint8_t rpl_modem_tx_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00080000)) >> 19);
}

__STATIC_FORCEINLINE void rpl_modem_tx_en_setf(uint8_t modemtxen)
{
    ASSERT_ERR((((uint32_t)modemtxen << 19) & ~((uint32_t)0x00080000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00080000)) | ((uint32_t)modemtxen << 19));
}

__STATIC_FORCEINLINE uint8_t rpl_fmtx2p_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00040000)) >> 18);
}

__STATIC_FORCEINLINE void rpl_fmtx2p_on_setf(uint8_t fmtx2pon)
{
    ASSERT_ERR((((uint32_t)fmtx2pon << 18) & ~((uint32_t)0x00040000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00040000)) | ((uint32_t)fmtx2pon << 18));
}

__STATIC_FORCEINLINE uint8_t rpl_txfiltq_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00020000)) >> 17);
}

__STATIC_FORCEINLINE void rpl_txfiltq_on_setf(uint8_t txfiltqon)
{
    ASSERT_ERR((((uint32_t)txfiltqon << 17) & ~((uint32_t)0x00020000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00020000)) | ((uint32_t)txfiltqon << 17));
}

__STATIC_FORCEINLINE uint8_t rpl_txfilti_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00010000)) >> 16);
}

__STATIC_FORCEINLINE void rpl_txfilti_on_setf(uint8_t txfiltion)
{
    ASSERT_ERR((((uint32_t)txfiltion << 16) & ~((uint32_t)0x00010000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00010000)) | ((uint32_t)txfiltion << 16));
}

__STATIC_FORCEINLINE uint8_t rpl_txdacq_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00008000)) >> 15);
}

__STATIC_FORCEINLINE void rpl_txdacq_on_setf(uint8_t txdacqon)
{
    ASSERT_ERR((((uint32_t)txdacqon << 15) & ~((uint32_t)0x00008000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00008000)) | ((uint32_t)txdacqon << 15));
}

__STATIC_FORCEINLINE uint8_t rpl_txdaci_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00004000)) >> 14);
}

__STATIC_FORCEINLINE void rpl_txdaci_on_setf(uint8_t txdacion)
{
    ASSERT_ERR((((uint32_t)txdacion << 14) & ~((uint32_t)0x00004000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00004000)) | ((uint32_t)txdacion << 14));
}

__STATIC_FORCEINLINE uint8_t rpl_fmtx_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00002000)) >> 13);
}

__STATIC_FORCEINLINE void rpl_fmtx_on_setf(uint8_t fmtxon)
{
    ASSERT_ERR((((uint32_t)fmtxon << 13) & ~((uint32_t)0x00002000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00002000)) | ((uint32_t)fmtxon << 13));
}

__STATIC_FORCEINLINE uint8_t rpl_txpa_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00001000)) >> 12);
}

__STATIC_FORCEINLINE void rpl_txpa_on_setf(uint8_t txpaon)
{
    ASSERT_ERR((((uint32_t)txpaon << 12) & ~((uint32_t)0x00001000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00001000)) | ((uint32_t)txpaon << 12));
}

