tyh21/da14585_420/da14585_420_Paged_Clock/sdk/platform/driver/ble/reg_ripple.h
    *txrxctrlforce = (localVal & ((uint32_t)0x80000000)) >> 31;
    *vcofcicpcalforce = (localVal & ((uint32_t)0x40000000)) >> 30;
    *vcofccalicpmode = (localVal & ((uint32_t)0x00001000)) >> 12;
    *rxmdmbypassen = (localVal & ((uint32_t)0x00000200)) >> 9;
    *txmdmbypassen = (localVal & ((uint32_t)0x00000100)) >> 8;
    *rfpllcaltimeoutdsb = (localVal & ((uint32_t)0x00000040)) >> 6;
    *icpcalstart = (localVal & ((uint32_t)0x00000020)) >> 5;
    *vcofccalstart = (localVal & ((uint32_t)0x00000010)) >> 4;
    *pdon = (localVal & ((uint32_t)0x00000004)) >> 2;
    *bbbiason = (localVal & ((uint32_t)0x00000002)) >> 1;
    *lodiv2on = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_txrxctrl_force_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__STATIC_FORCEINLINE void rpl_txrxctrl_force_setf(uint8_t txrxctrlforce)
{
    ASSERT_ERR((((uint32_t)txrxctrlforce << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_RPL_WR(RPL_RFTXRXCNTL_ADDR, (REG_RPL_RD(RPL_RFTXRXCNTL_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)txrxctrlforce << 31));
}

__STATIC_FORCEINLINE uint8_t rpl_vcofc_icp_cal_force_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x40000000)) >> 30);
}

__STATIC_FORCEINLINE void rpl_vcofc_icp_cal_force_setf(uint8_t vcofcicpcalforce)
{
    ASSERT_ERR((((uint32_t)vcofcicpcalforce << 30) & ~((uint32_t)0x40000000)) == 0);
    REG_RPL_WR(RPL_RFTXRXCNTL_ADDR, (REG_RPL_RD(RPL_RFTXRXCNTL_ADDR) & ~((uint32_t)0x40000000)) | ((uint32_t)vcofcicpcalforce << 30));
}

__STATIC_FORCEINLINE uint8_t rpl_vcofc_cal_icp_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00001000)) >> 12);
}

__STATIC_FORCEINLINE void rpl_vcofc_cal_icp_mode_setf(uint8_t vcofccalicpmode)
{
    ASSERT_ERR((((uint32_t)vcofccalicpmode << 12) & ~((uint32_t)0x00001000)) == 0);
    REG_RPL_WR(RPL_RFTXRXCNTL_ADDR, (REG_RPL_RD(RPL_RFTXRXCNTL_ADDR) & ~((uint32_t)0x00001000)) | ((uint32_t)vcofccalicpmode << 12));
}

__STATIC_FORCEINLINE uint8_t rpl_rxmdm_bypass_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000200)) >> 9);
}

__STATIC_FORCEINLINE void rpl_rxmdm_bypass_en_setf(uint8_t rxmdmbypassen)
{
    ASSERT_ERR((((uint32_t)rxmdmbypassen << 9) & ~((uint32_t)0x00000200)) == 0);
    REG_RPL_WR(RPL_RFTXRXCNTL_ADDR, (REG_RPL_RD(RPL_RFTXRXCNTL_ADDR) & ~((uint32_t)0x00000200)) | ((uint32_t)rxmdmbypassen << 9));
}

__STATIC_FORCEINLINE uint8_t rpl_txmdm_bypass_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

__STATIC_FORCEINLINE void rpl_txmdm_bypass_en_setf(uint8_t txmdmbypassen)
{
    ASSERT_ERR((((uint32_t)txmdmbypassen << 8) & ~((uint32_t)0x00000100)) == 0);
    REG_RPL_WR(RPL_RFTXRXCNTL_ADDR, (REG_RPL_RD(RPL_RFTXRXCNTL_ADDR) & ~((uint32_t)0x00000100)) | ((uint32_t)txmdmbypassen << 8));
}

__STATIC_FORCEINLINE uint8_t rpl_rfpll_cal_timeout_dsb_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000040)) >> 6);
}

__STATIC_FORCEINLINE void rpl_rfpll_cal_timeout_dsb_setf(uint8_t rfpllcaltimeoutdsb)
{
    ASSERT_ERR((((uint32_t)rfpllcaltimeoutdsb << 6) & ~((uint32_t)0x00000040)) == 0);
    REG_RPL_WR(RPL_RFTXRXCNTL_ADDR, (REG_RPL_RD(RPL_RFTXRXCNTL_ADDR) & ~((uint32_t)0x00000040)) | ((uint32_t)rfpllcaltimeoutdsb << 6));
}

__STATIC_FORCEINLINE uint8_t rpl_icp_cal_start_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000020)) >> 5);
}

__STATIC_FORCEINLINE void rpl_icp_cal_start_setf(uint8_t icpcalstart)
{
    ASSERT_ERR((((uint32_t)icpcalstart << 5) & ~((uint32_t)0x00000020)) == 0);
    REG_RPL_WR(RPL_RFTXRXCNTL_ADDR, (REG_RPL_RD(RPL_RFTXRXCNTL_ADDR) & ~((uint32_t)0x00000020)) | ((uint32_t)icpcalstart << 5));
}

__STATIC_FORCEINLINE uint8_t rpl_vcofc_cal_start_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__STATIC_FORCEINLINE void rpl_vcofc_cal_start_setf(uint8_t vcofccalstart)
{
    ASSERT_ERR((((uint32_t)vcofccalstart << 4) & ~((uint32_t)0x00000010)) == 0);
    REG_RPL_WR(RPL_RFTXRXCNTL_ADDR, (REG_RPL_RD(RPL_RFTXRXCNTL_ADDR) & ~((uint32_t)0x00000010)) | ((uint32_t)vcofccalstart << 4));
}

__STATIC_FORCEINLINE uint8_t rpl_pd_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__STATIC_FORCEINLINE void rpl_pd_on_setf(uint8_t pdon)
{
    ASSERT_ERR((((uint32_t)pdon << 2) & ~((uint32_t)0x00000004)) == 0);
    REG_RPL_WR(RPL_RFTXRXCNTL_ADDR, (REG_RPL_RD(RPL_RFTXRXCNTL_ADDR) & ~((uint32_t)0x00000004)) | ((uint32_t)pdon << 2));
}

__STATIC_FORCEINLINE uint8_t rpl_bb_bias_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__STATIC_FORCEINLINE void rpl_bb_bias_on_setf(uint8_t bbbiason)
{
    ASSERT_ERR((((uint32_t)bbbiason << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_RPL_WR(RPL_RFTXRXCNTL_ADDR, (REG_RPL_RD(RPL_RFTXRXCNTL_ADDR) & ~((uint32_t)0x00000002)) | ((uint32_t)bbbiason << 1));
}

__STATIC_FORCEINLINE uint8_t rpl_lodiv2_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__STATIC_FORCEINLINE void rpl_lodiv2_on_setf(uint8_t lodiv2on)
{
    ASSERT_ERR((((uint32_t)lodiv2on << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_RFTXRXCNTL_ADDR, (REG_RPL_RD(RPL_RFTXRXCNTL_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)lodiv2on << 0));
}

/**
 * @brief RFTXRXCONFIG register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31         DATA_BUS_POL   0
 *     30          ICP_CAL_DSB   0
 *  29:28           CALIB_MODE   0x2
 *  27:20   CALIB_TIMEOUT_DELAY   0xFF
 *  19:14   ICP_CAL_SETTLE_TIME   0x5
 *  13:08   VCOFC_CAL_SETTLE_TIME   0x5
 *  07:06          BB_BIAS_CFG   0x0
 *     04         DAP_CLK_MODE   0
 *  03:02          LODIV2_TRIM   0x0
 *  01:00           LOBUF_TRIM   0x0
 * </pre>
 */
#define RPL_RFTXRXCONFIG_ADDR   0x00000074
#define RPL_RFTXRXCONFIG_OFFSET 0x00000074
#define RPL_RFTXRXCONFIG_INDEX  0x00000074
#define RPL_RFTXRXCONFIG_RESET  0x2FF14500

