tyh21/da14585_420/da14585_420_Paged_Clock/sdk/platform/driver/ble/reg_ripple.h
__STATIC_FORCEINLINE void rpl_vcofc_cal_settle_time_setf(uint8_t vcofccalsettletime)
{
    ASSERT_ERR((((uint32_t)vcofccalsettletime << 8) & ~((uint32_t)0x00003F00)) == 0);
    REG_RPL_WR(RPL_RFTXRXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR) & ~((uint32_t)0x00003F00)) | ((uint32_t)vcofccalsettletime << 8));
}

__STATIC_FORCEINLINE uint8_t rpl_bb_bias_cfg_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x000000C0)) >> 6);
}

__STATIC_FORCEINLINE void rpl_bb_bias_cfg_setf(uint8_t bbbiascfg)
{
    ASSERT_ERR((((uint32_t)bbbiascfg << 6) & ~((uint32_t)0x000000C0)) == 0);
    REG_RPL_WR(RPL_RFTXRXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR) & ~((uint32_t)0x000000C0)) | ((uint32_t)bbbiascfg << 6));
}

__STATIC_FORCEINLINE uint8_t rpl_dap_clk_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__STATIC_FORCEINLINE void rpl_dap_clk_mode_setf(uint8_t dapclkmode)
{
    ASSERT_ERR((((uint32_t)dapclkmode << 4) & ~((uint32_t)0x00000010)) == 0);
    REG_RPL_WR(RPL_RFTXRXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR) & ~((uint32_t)0x00000010)) | ((uint32_t)dapclkmode << 4));
}

__STATIC_FORCEINLINE uint8_t rpl_lodiv2_trim_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x0000000C)) >> 2);
}

__STATIC_FORCEINLINE void rpl_lodiv2_trim_setf(uint8_t lodiv2trim)
{
    ASSERT_ERR((((uint32_t)lodiv2trim << 2) & ~((uint32_t)0x0000000C)) == 0);
    REG_RPL_WR(RPL_RFTXRXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR) & ~((uint32_t)0x0000000C)) | ((uint32_t)lodiv2trim << 2));
}

__STATIC_FORCEINLINE uint8_t rpl_lobuf_trim_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x00000003)) >> 0);
}

__STATIC_FORCEINLINE void rpl_lobuf_trim_setf(uint8_t lobuftrim)
{
    ASSERT_ERR((((uint32_t)lobuftrim << 0) & ~((uint32_t)0x00000003)) == 0);
    REG_RPL_WR(RPL_RFTXRXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR) & ~((uint32_t)0x00000003)) | ((uint32_t)lobuftrim << 0));
}

/**
 * @brief RFTXRXSTAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     03          CAL_TIMEOUT   0
 *     01         ICP_CAL_DONE   0
 *     00       VCOFC_CAL_DONE   0
 * </pre>
 */
#define RPL_RFTXRXSTAT_ADDR   0x00000075
#define RPL_RFTXRXSTAT_OFFSET 0x00000075
#define RPL_RFTXRXSTAT_INDEX  0x00000075
#define RPL_RFTXRXSTAT_RESET  0x00000000

__STATIC_FORCEINLINE uint32_t rpl_rftxrxstat_get(void)
{
    return REG_RPL_RD(RPL_RFTXRXSTAT_ADDR);
}

// field definitions
#define RPL_CAL_TIMEOUT_BIT       ((uint32_t)0x00000008)
#define RPL_CAL_TIMEOUT_POS       3
#define RPL_ICP_CAL_DONE_BIT      ((uint32_t)0x00000002)
#define RPL_ICP_CAL_DONE_POS      1
#define RPL_VCOFC_CAL_DONE_BIT    ((uint32_t)0x00000001)
#define RPL_VCOFC_CAL_DONE_POS    0

#define RPL_CAL_TIMEOUT_RST       0x0
#define RPL_ICP_CAL_DONE_RST      0x0
#define RPL_VCOFC_CAL_DONE_RST    0x0

__STATIC_FORCEINLINE void rpl_rftxrxstat_unpack(uint8_t* caltimeout, uint8_t* icpcaldone, uint8_t* vcofccaldone)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXSTAT_ADDR);

    *caltimeout = (localVal & ((uint32_t)0x00000008)) >> 3;
    *icpcaldone = (localVal & ((uint32_t)0x00000002)) >> 1;
    *vcofccaldone = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__STATIC_FORCEINLINE uint8_t rpl_cal_timeout_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__STATIC_FORCEINLINE uint8_t rpl_icp_cal_done_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__STATIC_FORCEINLINE uint8_t rpl_vcofc_cal_done_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

/**
 * @brief SAR_ADC_CNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31        SAR_ADC_FORCE   0
 *  07:04          SAR_ADC_SEL   0x0
 *     02         SAR_ADC_MODE   0
 *     01        SAR_ADC_START   0
 *     00           SAR_ADC_ON   0
 * </pre>
 */
#define RPL_SAR_ADC_CNTL_ADDR   0x00000076
#define RPL_SAR_ADC_CNTL_OFFSET 0x00000076
#define RPL_SAR_ADC_CNTL_INDEX  0x00000076
#define RPL_SAR_ADC_CNTL_RESET  0x00000000

__STATIC_FORCEINLINE uint32_t rpl_sar_adc_cntl_get(void)
{
    return REG_RPL_RD(RPL_SAR_ADC_CNTL_ADDR);
}

__STATIC_FORCEINLINE void rpl_sar_adc_cntl_set(uint32_t value)
{
    REG_RPL_WR(RPL_SAR_ADC_CNTL_ADDR, value);
}

// field definitions
#define RPL_SAR_ADC_FORCE_BIT    ((uint32_t)0x80000000)
#define RPL_SAR_ADC_FORCE_POS    31
#define RPL_SAR_ADC_SEL_MASK     ((uint32_t)0x000000F0)
#define RPL_SAR_ADC_SEL_LSB      4
#define RPL_SAR_ADC_SEL_WIDTH    ((uint32_t)0x00000004)
#define RPL_SAR_ADC_MODE_BIT     ((uint32_t)0x00000004)
#define RPL_SAR_ADC_MODE_POS     2
#define RPL_SAR_ADC_START_BIT    ((uint32_t)0x00000002)
#define RPL_SAR_ADC_START_POS    1
#define RPL_SAR_ADC_ON_BIT       ((uint32_t)0x00000001)
#define RPL_SAR_ADC_ON_POS       0

#define RPL_SAR_ADC_FORCE_RST    0x0
#define RPL_SAR_ADC_SEL_RST      0x0
#define RPL_SAR_ADC_MODE_RST     0x0
#define RPL_SAR_ADC_START_RST    0x0
#define RPL_SAR_ADC_ON_RST       0x0

__STATIC_FORCEINLINE void rpl_sar_adc_cntl_pack(uint8_t saradcforce, uint8_t saradcsel, uint8_t saradcmode, uint8_t saradcstart, uint8_t saradcon)
{
    ASSERT_ERR((((uint32_t)saradcforce << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)saradcsel << 4) & ~((uint32_t)0x000000F0)) == 0);
    ASSERT_ERR((((uint32_t)saradcmode << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)saradcstart << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)saradcon << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_SAR_ADC_CNTL_ADDR,  ((uint32_t)saradcforce << 31) | ((uint32_t)saradcsel << 4) | ((uint32_t)saradcmode << 2) | ((uint32_t)saradcstart << 1) | ((uint32_t)saradcon << 0));
}

__STATIC_FORCEINLINE void rpl_sar_adc_cntl_unpack(uint8_t* saradcforce, uint8_t* saradcsel, uint8_t* saradcmode, uint8_t* saradcstart, uint8_t* saradcon)
{
    uint32_t localVal = REG_RPL_RD(RPL_SAR_ADC_CNTL_ADDR);

    *saradcforce = (localVal & ((uint32_t)0x80000000)) >> 31;
    *saradcsel = (localVal & ((uint32_t)0x000000F0)) >> 4;
    *saradcmode = (localVal & ((uint32_t)0x00000004)) >> 2;
    *saradcstart = (localVal & ((uint32_t)0x00000002)) >> 1;
    *saradcon = (localVal & ((uint32_t)0x00000001)) >> 0;
}

